//EBUD0RUN JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=NOLIMIT,REGION=0M,COND=(16,LT)
//*
//GO    EXEC PGM=EBUD0RUN
//******* ADDITIONAL RUNTIME JCL HERE ******
//STEPLIB  DD DISP=SHR,DSN=CEE.SCEERUN
//         DD DISP=SHR,DSN=DBEHM.DBB.UB.LOAD
//SYSIN DD *
1984
03
21
/*
