          05 L-INPUT-DATE.
             10 L-CCYY       PIC X(4).
             10 L-MM         PIC X(2).
             10 L-DD         PIC X(2).
          05 DAYS-DIFF       PIC 9(8) COMP.
      *   05 RETIREMENT-DATE PIC X(8).
          05 RETIREMENT-DATE PIC X(80).
          05 RETC            PIC S9(4) COMP.